//
//  main.cpp
//  ArraySumEvenRows
//
//  Created by Rado on 10.12.23.
//

/* Имате предварително въведени стойности от естествени числа, принадлежащи на интервала [10..99]. числата са въведени в квадратна таблица с размери 6 реда и 6 колони.
 Да се състави програма на C++, чрез която се намира сумата на всички елементи от редовете с четни номера: 2,4 и 6.
 Програмата да извежда и сумата на всеки отделен ред.
 Пример:
 11,12,13,14,15,16,
 21,22,23,24,25,26,
 31,32,33,34,35,36,
 41,42,43,44,45,46,
 51,52,53,54,55,56,
 61,62,63,64,65,66
 Изход:
 21,22,23,24,25,26 сума 141
 41,42,43,44,45,46 сума 261
 61,62,63,64,65,66 сума 381
 Сума на елементите 783*/

#include <iostream>
using namespace std;

const int ROWS = 6;
const int COLS = 6;

int main(int argc, const char * argv[]) {
    
    int matrix[ROWS][COLS] = {
        {11,12,13,14,15,16},
        {21,22,23,24,25,26},
        {31,32,33,34,35,36},
        {41,42,43,44,45,46},
        {51,52,53,54,55,56},
        {61,62,63,64,65,66}
    };
    
    int sumEvenRows = 0;
    
    for (int i = 1; i < ROWS; i += 2) {
        int rowSum = 0;
        cout << "Row " << i+1 << ": ";
        for (int j = 0; j < COLS; ++j) {
            cout << matrix[i][j] << " ";
            rowSum += matrix[i][j];
        }
        cout << "sum: " << rowSum << endl;
        sumEvenRows += rowSum;
    }
    cout << "Sum of row elements with even indexes: " << sumEvenRows << endl;

    return 0;
}
