//
//  main.cpp
//  1st
//
//  Created by Rado on 13.12.23.
//

// Радослав Богданов

#include <iostream>
using namespace std;

int main(int argc, const char * argv[]) {
    
    /* Задача 1: Дадено в числото N. Да се напише програма която определя дали N се дели на 5 и
     3 едновременно. N се въвежда от клавиатурата. Резултатът се извежда на екрана.*/
    
    //int n;
    //cout << "enter value of number: " << endl;
    //cin >> n;  // въвеждаме стойност от конзолата
    //
    //if (n % 5 == 0 && n % 3 == 0){ // проверяваме дали тази стойност се дели без остатък на 3 и 5
    //    cout << "number match -> " << n << endl;
    //}else{
    //    cout << "number not match " << n << endl;
    //}
    
    
    /* Задача 2: Напишете програма която намира броя на всички четирицифрени числа на които
     първата и*/
    //int sum = 0;
    //int times = 0;
    //
    //for (int i = 1000; i < 9999; i++){ // въртим цикъл в диапазон по даденото условие
    //    int first = i / 1000; // целочислено делим на 1000 за да вземем първата цифра от 4 цифреното чисто
    //    int fourth = i % 10; // делим на 10 без остатък за да вземем последната цифра от числото
    //
    //    if (first == fourth){ // проверяваме дали числата са еднакви, ако да го добавяме в съответната променлива за сумиране
    //        sum += i;
    //        times++; // променлива колко пъти сме добавили
    //    }
    //}
    //
    //cout << "Founded numbers sum : " << sum << endl;
    //cout << "Times founded: " << times << endl;
    
    //return 0;
    
    /* Задача 3: Даден е едномерен масив А[n]. Напишете програма която намира сумата на
     елементите с нечетна стойност. N и елементите на масива се въвеждат от клавиатурата.
     Резултатът се извежда на екрана.*/
    
    //. int n;
    //. cout << "enter array size: ";
    //. cin >> n; // въвеждаме размер на масива от конзолата
    //.
    //. int arr[n]; // създаваме масив със съответния размер
    //. int sum = 0; // тук събираме сумата
    //.
    //. for (int i = 0; i < n; i++){ // цикъл , които итерира до зададения размер
    //.     int num;  // декларираме променлива num
    //.     cout << "enter number : " << endl;
    //.     cin >> num; // въвеждаме променливата от конзолата
    //.     arr[i] = num; // масивът от конкретната итерация присвоява променливата
    //.
    //.     if (arr[i] % 2 != 0){ // ако стойносттан на конкретната итерация в масива не се дели на 2 без остатък
    //.         sum += arr[i];  // в променливата  sum добавяме сумата в конкретната клетка
    //.     }
    //. }
    //.
    //. cout << "sum of odd elements in arr: " << sum << endl;
    
    /*Задача 4: Даденa е матрица с размер [n]. Напишете програма която намира броят на
     елементите с отрицателна стойност, разположени на редове с четни индекси. N, M и
     елементите на масива се въвеждат от клавиатурата. Резултатът се извежда на екрана.*/
    
    int n;
    cout << "enter matrix size" << endl;
    cin >> n; // въвеждаме размера на матрицата
    int matrix[n][n];
    
    int negative = 0; // променлива за негативните числа
    
    for (int i = 0; i < n; i++){ // попълваме матрицата със стойности
        for (int j = 0; j < n; j++){
            cin >> matrix[i][j];
        }
    }
    
    for (int i = 0; i < n; i++){ // в този цикъл въртим и проверяваме конкретната клетка дали съдържа стойност по-малка от 0 и дали итерацията е четно число
        for (int j = 0; j < n; j++){
            if (matrix[i][j] < 0 && i % 2 == 0 && i > 0){
                negative++; // +1 в променливата ако отговаряме на условието
            }
        }
    }
    
    cout << "count negative values: " << negative << endl; // принтираме всички негативни числа
    
    return  0;
}
    

